## Pandas

we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. We covers the topics  in this order:

* Series
* DataFrames
* Missing Data
* GroupBy
* Data Input and Output

### Series

Series is a one-dimensional labeled array Which are  capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

In [47]:
import numpy as np
import pandas as pd
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [48]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [49]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

#### NumPy Arrays

In [50]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [51]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

### Dictionary

In [52]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

##### A pandas Series can hold a variety of object types:

In [53]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

### Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like dictionary).

Let's see some examples of how to grab information from a Series. Let us create two series,series1 and series2:

In [54]:
series1 = pd.Series([1,2,3,4],index = ['Trivandrum', 'Kozhikode','Kannur', 'Ernakulam'])

In [55]:
series2 = pd.Series([1,2,3,4],index = ['Trivandrum', 'Kozhikode','Kollam', 'Ernakulam'])

In [56]:
series1 + series2

Ernakulam     8.0
Kannur        NaN
Kollam        NaN
Kozhikode     4.0
Trivandrum    2.0
dtype: float64

# Dataframes
A Data frame is a two-dimensional data structure,Here data is aligned in a tabular format in rows and columns.
Dataframe is a collection of series(columns) are of different types.Size are Mutable

In [57]:
import pandas as pd
import numpy as np

In [58]:
from numpy.random import randn
randn(5,4)

array([[ 0.47861805, -1.9312866 ,  1.26983497,  0.53882828],
       [-0.12657666,  0.03594193,  0.83227396, -0.01901963],
       [-0.72603707, -0.00710205,  0.28753536, -0.5824708 ],
       [ 0.44442667,  1.22466696,  1.82447359,  0.35414558],
       [-0.69839132,  0.19702618, -1.13594069, -0.13639151]])

In [59]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [60]:
df

          W         X         Y         Z
A -0.786696  0.915165 -0.608545  0.014708
B  1.527938  0.377589 -1.677770 -0.004005
C  0.727329  0.775309  0.090156 -0.178610
D -0.754168  0.912399  1.460494  1.741343
E -0.657080  0.449602 -0.722642  0.542117

In [61]:
randn(3,5)

array([[-0.47097628,  1.59749943,  0.52771554, -0.07317008, -0.02800885],
       [ 0.55244813, -1.62937167, -0.56721404, -0.2068301 , -0.18756528],
       [ 2.40808757,  0.77322598,  1.18141003,  1.50891934, -1.54225913]])

### Selection and Indexing

Let's learn the various approach to grab data from a DataFrame

In [62]:
df['X']

A    0.915165
B    0.377589
C    0.775309
D    0.912399
E    0.449602
Name: X, dtype: float64

In [63]:
# Pass a list of column names
df[['X','Y']]

          X         Y
A  0.915165 -0.608545
B  0.377589 -1.677770
C  0.775309  0.090156
D  0.912399  1.460494
E  0.449602 -0.722642

In [64]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A   -0.786696
B    1.527938
C    0.727329
D   -0.754168
E   -0.657080
Name: W, dtype: float64

# DataFrame Columns are just called the collection of Series

In [65]:
type(df['W'])

pandas.core.series.Series

### Creating a new column:

In [66]:
df['new'] = df['W'] + df['Y']

In [67]:
df

          W         X         Y         Z       new
A -0.786696  0.915165 -0.608545  0.014708 -1.395241
B  1.527938  0.377589 -1.677770 -0.004005 -0.149833
C  0.727329  0.775309  0.090156 -0.178610  0.817485
D -0.754168  0.912399  1.460494  1.741343  0.706326
E -0.657080  0.449602 -0.722642  0.542117 -1.379722

Removing Columns

In [68]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.786696  0.915165 -0.608545  0.014708
B  1.527938  0.377589 -1.677770 -0.004005
C  0.727329  0.775309  0.090156 -0.178610
D -0.754168  0.912399  1.460494  1.741343
E -0.657080  0.449602 -0.722642  0.542117

In [69]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -0.786696  0.915165 -0.608545  0.014708 -1.395241
B  1.527938  0.377589 -1.677770 -0.004005 -0.149833
C  0.727329  0.775309  0.090156 -0.178610  0.817485
D -0.754168  0.912399  1.460494  1.741343  0.706326
E -0.657080  0.449602 -0.722642  0.542117 -1.379722

In [70]:
df.drop('new',axis=1,inplace=True)

In [71]:
df

          W         X         Y         Z
A -0.786696  0.915165 -0.608545  0.014708
B  1.527938  0.377589 -1.677770 -0.004005
C  0.727329  0.775309  0.090156 -0.178610
D -0.754168  0.912399  1.460494  1.741343
E -0.657080  0.449602 -0.722642  0.542117

In [72]:
df.drop('D',axis=0)

          W         X         Y         Z
A -0.786696  0.915165 -0.608545  0.014708
B  1.527938  0.377589 -1.677770 -0.004005
C  0.727329  0.775309  0.090156 -0.178610
E -0.657080  0.449602 -0.722642  0.542117

In [73]:
df

          W         X         Y         Z
A -0.786696  0.915165 -0.608545  0.014708
B  1.527938  0.377589 -1.677770 -0.004005
C  0.727329  0.775309  0.090156 -0.178610
D -0.754168  0.912399  1.460494  1.741343
E -0.657080  0.449602 -0.722642  0.542117

Selecting Rows

In [74]:
df.loc['A']

W   -0.786696
X    0.915165
Y   -0.608545
Z    0.014708
Name: A, dtype: float64

In [75]:
df.iloc[1]

W    1.527938
X    0.377589
Y   -1.677770
Z   -0.004005
Name: B, dtype: float64

### Selecting subset of rows and columns

In [76]:
df.loc['B','Y']

-1.6777704753696927

In [77]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.786696 -0.608545
B  1.527938 -1.677770

### Conditional Selection

In [78]:
df

          W         X         Y         Z
A -0.786696  0.915165 -0.608545  0.014708
B  1.527938  0.377589 -1.677770 -0.004005
C  0.727329  0.775309  0.090156 -0.178610
D -0.754168  0.912399  1.460494  1.741343
E -0.657080  0.449602 -0.722642  0.542117

In [79]:
df>0

       W     X      Y      Z
A  False  True  False   True
B   True  True  False  False
C   True  True   True  False
D  False  True   True   True
E  False  True  False   True

In [80]:
df[df>0]

          W         X         Y         Z
A       NaN  0.915165       NaN  0.014708
B  1.527938  0.377589       NaN       NaN
C  0.727329  0.775309  0.090156       NaN
D       NaN  0.912399  1.460494  1.741343
E       NaN  0.449602       NaN  0.542117

In [81]:
df[df['W']>0]

          W         X         Y         Z
B  1.527938  0.377589 -1.677770 -0.004005
C  0.727329  0.775309  0.090156 -0.178610

In [82]:
df[df['W']>0][['Y','X']]

          Y         X
B -1.677770  0.377589
C  0.090156  0.775309

#### For two conditions you can use | and & with parenthesis:

In [83]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [84]:
df

          W         X         Y         Z
A -0.786696  0.915165 -0.608545  0.014708
B  1.527938  0.377589 -1.677770 -0.004005
C  0.727329  0.775309  0.090156 -0.178610
D -0.754168  0.912399  1.460494  1.741343
E -0.657080  0.449602 -0.722642  0.542117

In [87]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.786696  0.915165 -0.608545  0.014708
1     B  1.527938  0.377589 -1.677770 -0.004005
2     C  0.727329  0.775309  0.090156 -0.178610
3     D -0.754168  0.912399  1.460494  1.741343
4     E -0.657080  0.449602 -0.722642  0.542117

In [102]:
newnames = 'a b c d e'.split()
newnames

['a', 'b', 'c', 'd', 'e']

In [103]:
df['names'] = newnames

In [104]:
df

          W         X         Y         Z names
A -0.786696  0.915165 -0.608545  0.014708     a
B  1.527938  0.377589 -1.677770 -0.004005     b
C  0.727329  0.775309  0.090156 -0.178610     c
D -0.754168  0.912399  1.460494  1.741343     d
E -0.657080  0.449602 -0.722642  0.542117     e

In [105]:
df.set_index('names')

              W         X         Y         Z
names
a     -0.786696  0.915165 -0.608545  0.014708
b      1.527938  0.377589 -1.677770 -0.004005
c      0.727329  0.775309  0.090156 -0.178610
d     -0.754168  0.912399  1.460494  1.741343
e     -0.657080  0.449602 -0.722642  0.542117

In [106]:
df.set_index('names',inplace=True)

In [107]:
df

              W         X         Y         Z
names
a     -0.786696  0.915165 -0.608545  0.014708
b      1.527938  0.377589 -1.677770 -0.004005
c      0.727329  0.775309  0.090156 -0.178610
d     -0.754168  0.912399  1.460494  1.741343
e     -0.657080  0.449602 -0.722642  0.542117

# Missing Data

In [108]:
import numpy as np
import pandas as pd

In [109]:
mdata = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [110]:
mdata

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [114]:
mdata.dropna()

     A    B  C
0  1.0  5.0  1

In [115]:
mdata.dropna(axis=1)

   C
0  1
1  2
2  3

In [116]:
mdata.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [118]:
mdata.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [119]:
mdata['A'].fillna(value=mdata['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby

#### The groupby method allows you to group rows of data together and call aggregate functions

In [120]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOGLE','GOOGLE','MICROSOFT','MICROSOFT','FACEBOOK','FACEBOOK'],
       'Person':['Kailas','Sanal','Amy','Sudeesh','Shanid','Jaison'],
       'Sales':[200,120,340,124,243,350]}

In [121]:
df = pd.DataFrame(data)

In [122]:
df

     Company   Person  Sales
0     GOOGLE   Kailas    200
1     GOOGLE    Sanal    120
2  MICROSOFT      Amy    340
3  MICROSOFT  Sudeesh    124
4   FACEBOOK   Shanid    243
5   FACEBOOK   Jaison    350

In [123]:
df.groupby('Company')

In [125]:
#You can save this object as a new variable:
by_comp = df.groupby("Company")
by_comp

In [126]:
by_comp.mean()

           Sales
Company
FACEBOOK   296.5
GOOGLE     160.0
MICROSOFT  232.0

In [127]:
#More examples of aggregate methods:
by_comp.std()

                Sales
Company
FACEBOOK    75.660426
GOOGLE      56.568542
MICROSOFT  152.735065

In [128]:
by_comp.min()

           Person  Sales
Company
FACEBOOK   Jaison    243
GOOGLE     Kailas    120
MICROSOFT     Amy    124

In [129]:
by_comp.max()

            Person  Sales
Company
FACEBOOK    Shanid    350
GOOGLE       Sanal    200
MICROSOFT  Sudeesh    340

In [130]:
by_comp.count()

           Person  Sales
Company
FACEBOOK        2      2
GOOGLE          2      2
MICROSOFT       2      2

In [131]:
by_comp.describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
FACEBOOK    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MICROSOFT   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [134]:
by_comp.describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
FACEBOOK    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MICROSOFT   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [136]:
by_comp.describe().transpose()['GOOGLE']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOGLE, dtype: float64

### Data Input and Output

In [2]:
import numpy as np
import pandas as pd

### CSV
CSV Input

In [5]:
df = pd.read_csv('mtcars.csv')
df.head()

,Unnamed: 0,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [6]:
# Use the multi-axes indexing funtion
print (df.loc[[10,1],['mpg','cyl']])

     mpg  cyl
10  17.8    6
1   21.0    6

In [7]:
# Use the multi-axes indexing funtion
print (df.loc[2:16,['mpg','cyl']])

     mpg  cyl
2   22.8    4
3   21.4    6
4   18.7    8
5   18.1    6
6   14.3    8
7   24.4    4
8   22.8    4
9   19.2    6
10  17.8    6
11  16.4    8
12  17.3    8
13  15.2    8
14  10.4    8
15  10.4    8
16  14.7    8

## Excel

In [12]:
import xlrd
xx = pd.read_excel('Sample-Sales-Data.xlsx',sheetname='Sheet1')
print(xx)

     Postcode  Sales_Rep_ID Sales_Rep_Name  Year         Value
0        2121           456           Jane  2011  84219.497311
1        2092           789         Ashish  2012  28322.192268
2        2128           456           Jane  2013  81878.997241
3        2073           123           John  2011  44491.142121
4        2134           789         Ashish  2012  71837.720959
5        2162           123           John  2013  64531.549254
6        2093           456           Jane  2011  58962.639832
7        2042           789         Ashish  2012  27521.791964
8        2198           123           John  2013  77985.126101
9        2043           789         Ashish  2011  49546.123317
10       2025           789         Ashish  2012  17733.774600
11       2045           456           Jane  2013  91125.995923
12       2090           456           Jane  2011  48112.764779
13       2114           456           Jane  2012  28361.338391
14       2142           456           Jane  2013  50911.554905
15       2062           123           John  2011  75538.869741
16       2049           456           Jane  2012  96922.328345
17       2204           456           Jane  2013  57838.175024
18       2000           456           Jane  2011   4529.748564
19       2135           123           John  2012  27761.119322
20       2115           456           Jane  2013  22772.698378
21       2032           789         Ashish  2011  98780.162874
22       2068           456           Jane  2012  66043.702356
23       2119           789         Ashish  2013  32882.274839
24       2060           456           Jane  2011  75822.406617
25       2072           456           Jane  2012  36675.400391
26       2045           123           John  2013  95816.702887
27       2140           456           Jane  2011  43627.200412
28       2205           789         Ashish  2012  93306.119892
29       2060           123           John  2013  71321.531952
..        ...           ...            ...   ...           ...
360      2099           123           John  2011  82289.521607
361      2125           123           John  2012  35987.130651
362      2089           789         Ashish  2013  89068.925598
363      2136           123           John  2011  83058.673232
364      2022           456           Jane  2012   1246.105766
365      2067           123           John  2013  57862.687410
366      2127           789         Ashish  2011  70493.892543
367      2118           456           Jane  2012  13243.311492
368      2065           123           John  2013  88484.975605
369      2193           789         Ashish  2011  82687.122346
370      2073           456           Jane  2012   3158.191319
371      2026           123           John  2013  55338.702312
372      2011           789         Ashish  2011  43355.923235
373      2087           123           John  2012   9482.659707
374      2024           456           Jane  2013  43002.163472
375      2192           789         Ashish  2011  24077.818787
376      2109           456           Jane  2012  45718.959503
377      2130           789         Ashish  2013  51693.360717
378      2194           123           John  2011  66864.306868
379      2141           123           John  2012  54682.868831
380      2136           789         Ashish  2013    881.774381
381      2033           789         Ashish  2011  76990.365801
382      2072           123           John  2012  35366.490144
383      2063           456           Jane  2013  93341.164487
384      2018           789         Ashish  2011  97167.784507
385      2164           123           John  2012  88884.535217
386      2193           456           Jane  2013  79440.290813
387      2031           123           John  2011  65643.689454
388      2130           456           Jane  2012  66247.874869
389      2116           456           Jane  2013   3195.699054

[390 rows x 5 columns]

/usr/lib/python3/dist-packages/pandas/util/_decorators.py:118: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

In [11]:
#!pip install xlrd

Defaulting to user installation because normal site-packages is not writeable
Collecting xlrd
  Downloading xlrd-1.2.0-py2.py3-none-any.whl (103 kB)
     |████████████████████████████████| 103 kB 112 kB/s eta 0:00:01
Installing collected packages: xlrd
Successfully installed xlrd-1.2.0
WARNING: You are using pip version 20.0.2; however, version 20.1 is available.
You should consider upgrading via the '/usr/bin/python3 -m pip install --upgrade pip' command.

In [13]:
# Use the multi-axes indexing funtion
print (xx.loc[[1,3,5],['Year','Value']])

   Year         Value
1  2012  28322.192268
3  2011  44491.142121
5  2013  64531.549254

In [14]:
print (xx[0:5]['Value'])

0    84219.497311
1    28322.192268
2    81878.997241
3    44491.142121
4    71837.720959
Name: Value, dtype: float64

# HTML

In [15]:
#!pip install lxml
#!pip install html5lib
#!pip install BeautifulSoup4

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: lxml in /usr/lib/python3/dist-packages (4.2.1)
WARNING: You are using pip version 20.0.2; however, version 20.1 is available.
You should consider upgrading via the '/usr/bin/python3 -m pip install --upgrade pip' command.
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: html5lib in /usr/lib/python3/dist-packages (0.999999999)
WARNING: You are using pip version 20.0.2; however, version 20.1 is available.
You should consider upgrading via the '/usr/bin/python3 -m pip install --upgrade pip' command.
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: BeautifulSoup4 in /home/deepu/.local/lib/python3.6/site-packages (4.9.0)
Requirement already satisfied: soupsieve>1.2 in /home/deepu/.local/lib/python3.6/site-packages (from BeautifulSoup4) (2.0)
WARNING: You are using pip version 20.0.2; however, version 20.1 is available.
You should consider upgrading via the '/usr/bin/python3 -m pip install --upgrade pip' command.

## HTML Input

In [16]:
df2 = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [17]:
df2

[                                             Bank Name                City  \
 0                                 The First State Bank       Barboursville
 1                                   Ericson State Bank             Ericson
 2                     City National Bank of New Jersey              Newark
 3                                        Resolute Bank              Maumee
 4                                Louisa Community Bank              Louisa
 5                                 The Enloe State Bank              Cooper
 6                  Washington Federal Bank for Savings             Chicago
 7      The Farmers and Merchants State Bank of Argonia             Argonia
 8                                  Fayette County Bank          Saint Elmo
 9    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 10                                      First NBC Bank         New Orleans
 11                                       Proficio Bank  Cottonwood Heights
 12                       Seaway Bank and Trust Company             Chicago
 13                              Harvest Community Bank          Pennsville
 14                                         Allied Bank            Mulberry
 15                        The Woodbury Banking Company            Woodbury
 16                              First CornerStone Bank     King of Prussia
 17                                  Trust Company Bank             Memphis
 18                          North Milwaukee State Bank           Milwaukee
 19                              Hometown National Bank            Longview
 20                                 The Bank of Georgia      Peachtree City
 21                                        Premier Bank              Denver
 22                                      Edgebrook Bank             Chicago
 23                              Doral Bank  En Español            San Juan
 24                   Capitol City Bank & Trust Company             Atlanta
 25                             Highland Community Bank             Chicago
 26                    First National Bank of Crestview           Crestview
 27                                  Northern Star Bank             Mankato
 28              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 29               The National Republic Bank of Chicago             Chicago
 ..                                                 ...                 ...
 531                                  ANB Financial, NA         Bentonville
 532                                          Hume Bank                Hume
 533                             Douglass National Bank         Kansas City
 534                                  Miami Valley Bank            Lakeview
 535                                            NetBank          Alpharetta
 536                          Metropolitan Savings Bank          Pittsburgh
 537                                    Bank of Ephraim             Ephraim
 538                                      Reliance Bank        White Plains
 539              Guaranty National Bank of Tallahassee         Tallahassee
 540                                Dollar Savings Bank              Newark
 541                               Pulaski Savings Bank        Philadelphia
 542              First National Bank of Blanchardville      Blanchardville
 543                              Southern Pacific Bank            Torrance
 544                        Farmers Bank of Cheneyville         Cheneyville
 545                                      Bank of Alamo               Alamo
 546             AmTrade International Bank  En Español             Atlanta
 547                     Universal Federal Savings Bank             Chicago
 548                       Connecticut Bank of Commerce            Stamford
 549                                   New Century Bank     Shelby Township
 550                              Net 1st National Bank          Boca Raton
 551                                       NextBank, NA             Phoenix
 552                           Oakwood Deposit Bank Co.             Oakwood
 553                              Bank of Sierra Blanca       Sierra Blanca
 554                      Hamilton Bank, NA  En Español               Miami
 555                             Sinclair National Bank            Gravette
 556                                 Superior Bank, FSB            Hinsdale
 557                                Malta National Bank               Malta
 558                    First Alliance Bank & Trust Co.          Manchester
 559                  National State Bank of Metropolis          Metropolis
 560                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date
 0    WV  14361                       MVB Bank, Inc.       April 3, 2020
 1    NE  18265           Farmers and Merchants Bank   February 14, 2020
 2    NJ  21111                      Industrial Bank    November 1, 2019
 3    OH  58317                   Buckeye State Bank    October 25, 2019
 4    KY  58112    Kentucky Farmers Bank Corporation    October 25, 2019
 5    TX  10716                   Legend Bank, N. A.        May 31, 2019
 6    IL  30570                   Royal Savings Bank   December 15, 2017
 7    KS  17719                          Conway Bank    October 13, 2017
 8    IL   1802            United Fidelity Bank, fsb        May 26, 2017
 9    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 10   LA  58302                         Whitney Bank      April 28, 2017
 11   UT  35495                    Cache Valley Bank       March 3, 2017
 12   IL  19328                  State Bank of Texas    January 27, 2017
 13   NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 14   AR     91                         Today's Bank  September 23, 2016
 15   GA  11297                          United Bank     August 19, 2016
 16   PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 17   TN   9956           The Bank of Fayette County      April 29, 2016
 18   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 19   WA  35156                       Twin City Bank     October 2, 2015
 20   GA  35259                        Fidelity Bank     October 2, 2015
 21   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 22   IL  57772             Republic Bank of Chicago         May 8, 2015
 23   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 24   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 25   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 26   FL  17557                       First NBC Bank    January 16, 2015
 27   MN  34983                            BankVista   December 19, 2014
 28   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 29   IL    916                  State Bank of Texas    October 24, 2014
 ..   ..    ...                                  ...                 ...
 531  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 532  MO   1971                        Security Bank       March 7, 2008
 533  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 534  OH  16848         The Citizens Banking Company     October 4, 2007
 535  GA  32575                           ING DIRECT  September 28, 2007
 536  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 537  UT   1249                        Far West Bank       June 25, 2004
 538  NY  26778                     Union State Bank      March 19, 2004
 539  FL  26838              Hancock Bank of Florida      March 12, 2004
 540  NJ  31330                          No Acquirer   February 14, 2004
 541  PA  27203                       Earthstar Bank   November 14, 2003
 542  WI  11639                        The Park Bank         May 9, 2003
 543  CA  27094                            Beal Bank    February 7, 2003
 544  LA  16445            Sabine State Bank & Trust   December 17, 2002
 545  TN   9961                          No Acquirer    November 8, 2002
 546  GA  33784                          No Acquirer  September 30, 2002
 547  IL  29355               Chicago Community Bank       June 27, 2002
 548  CT  19183                   Hudson United Bank       June 26, 2002
 549  MI  34979                          No Acquirer      March 28, 2002
 550  FL  26652                       Bank Leumi USA       March 1, 2002
 551  AZ  22314                          No Acquirer    February 7, 2002
 552  OH   8966       The State Bank & Trust Company    February 1, 2002
 553  TX  22002     The Security State Bank of Pecos    January 18, 2002
 554  FL  24382     Israel Discount Bank of New York    January 11, 2002
 555  AR  34248                   Delta Trust & Bank   September 7, 2001
 556  IL  32646                Superior Federal, FSB       July 27, 2001
 557  OH   6629                    North Valley Bank         May 3, 2001
 558  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 559  IL   3815              Banterra Bank of Marion   December 14, 2000
 560  HI  21029                   Bank of the Orient    October 13, 2000

 [561 rows x 6 columns]]

## Json Data

In [18]:
import pandas as pd

data = pd.read_json('datajs.json')
print(data)

         Dept  ID      Name  Salary   StartDate
0          IT   1      Rick  623.30    1/1/2012
1  Operations   2       Dan  515.20   9/23/2013
2          IT   3  Michelle  611.00  11/15/2014
3          HR   4      Ryan  729.00   5/11/2014
4     Finance   5      Gary  843.25   3/27/2015
5          IT   6      Nina  578.00   5/21/2013
6  Operations   7     Simon  632.80   7/30/2013
7     Finance   8      Guru  722.50   6/17/2014

In [ ]:
# Use the multi-axes indexing funtion
print (data.loc[[1,3,5],['Salary','Name']])